{
  "topic": "10第十节 股市投资手册",
  "key_concepts": [
    {
      "name": "DDM模型（股利贴现模型）",
      "definition": "股票投资的经典分析框架。其核心思想是：公司未来派发的所有股息折现到当前时点的总和，构成了股票的内在价值。可简化为：股价 = 股息 / (无风险利率 + 风险溢价)。",
      "importance": "该模型的意义不在于精确计算估值，而在于提供了一个结构化分析框架：分子端（股息/企业盈利）和分母端（无风险利率与风险溢价），是理解股价驱动因素的基础。"
    },
    {
      "name": "企业盈利",
      "definition": "受宏观经济周期和企业自身基本面影响，是企业创造价值的核心。",
      "importance": "与股价正相关。是企业内生增长和DDM模型分子端的核心驱动因素。"
    },
    {
      "name": "无风险收益率",
      "definition": "一般指央行基准利率或国债收益率，代表无信用风险的资金成本。",
      "importance": "与股价负相关。是所有资产定价的“锚”，受央行货币政策直接影响。利率上升会压低股市估值，反之则提升估值。"
    },
    {
      "name": "风险溢价",
      "definition": "也称为风险偏好，是投资者因承担风险而要求的额外回报，衡量市场情绪。",
      "importance": "与股价负相关。风险偏好高时，投资者要求的回报率低，股市估值上升；风险偏好低时则相反。"
    },
    {
      "name": "价值投资",
      "definition": "通过分析企业基本面，以低于内在价值的价格买入并长期持有，赚取企业业绩增长的钱。",
      "importance": "核心关注DDM模型分子端（企业盈利），受经济基本面和公司经营影响大。"
    },
    {
      "name": "成长股投资",
      "definition": "投资于未来增长潜力巨大的公司，其当前可能盈利有限，赚取的主要是估值提升的钱。",
      "importance": "对资金成本（利率）和市场情绪极其敏感，核心关注DDM模型分母端（无风险利率和风险溢价）。"
    },
    {
      "name": "周期股投资",
      "definition": "投资于业绩与宏观经济周期波动强相关的公司，其股价呈现明显的轮动特征。",
      "importance": "不适合长期持有，关键在于把握经济周期（复苏到过热）的节拍进行投资。"
    }
  ],
  "indicators": [
    {
      "name": "净利润率",
      "calculation": "（营业收入 - 主营业务成本 - 营业及其他费用 - 利息 - 税务）/ 营业收入 * 100%。",
      "interpretation": "衡量企业每卖出一元商品，最终能获利多少。比率越高，代表企业盈利能力越强。"
    },
    {
      "name": "投入资本回报率（ROIC）",
      "calculation": "息前税后经营利润 / （总资产 - 无息流动负债 - 商誉） * 100%。",
      "interpretation": "衡量企业每投入一元钱在主营业务上，能赚回多少钱。反映了企业运用资本的效率。"
    },
    {
      "name": "每股收益（EPS）",
      "calculation": "（税后净收益 - 优先股股息）/ 发行在外普通股股数。",
      "interpretation": "体现固定时间内，企业利用股东权益为资本，所创造的归属普通股股东的收益能力。"
    },
    {
      "name": "风险偏好观测指标",
      "calculation": "定性/定量观测",
      "interpretation": "包括新开户投资者数量、偏股基金发行规模、成交量、换手率等。这些指标数值越大，通常表明市场越活跃，投资者风险偏好越高。"
    }
  ],
  "analysis_methods": [
    {
      "name": "DDM模型市场驱动逻辑分析",
      "steps": "1. 分解市场上涨（牛市）的驱动因素。2. 判断主要驱动力来自分子端（盈利）还是分母端（利率或情绪）。",
      "application": "用于识别不同类型牛市的本质：1）周期牛：主要由经济向好、企业盈利（分子端）改善驱动。2）水牛：主要由货币宽松、利率下行（分母端）驱动，这是历史上大多数牛市的成因。3）改革牛：主要由改革预期提升风险偏好、降低风险溢价（分母端）驱动。"
    },
    {
      "name": "基于DDM框架的投资风格适配",
      "steps": "1. 识别当前市场的核心矛盾（是盈利变化、利率走势还是情绪波动？）。2. 根据核心矛盾选择相适配的投资风格。",
      "application": "1）当企业盈利是核心变量时（如经济复苏期），侧重价值投资。2）当利率和风险偏好是核心变量时（如货币宽松期），侧重成长股投资。3）当经济周期波动是核心变量时，采取周期股投资策略，在复苏到过热阶段参与。"
    }
  ],
  "summary": "DDM模型是股市投资的经典分析框架。股价由企业盈利（分子端，正相关）、无风险收益率（分母端，负相关）和风险溢价（分母端，负相关）共同决定。研究发现，股市在很大程度上是“货币的晴雨表”，多数牛市由货币宽松（分母端利率下降）驱动。投资者需理解该框架，并据此灵活运用于价值（重分子）、成长（重分母）和周期（重经济节拍）三种不同的投资风格中，结合逆向思维，以提高投资胜率。"
}