{
  "topic": "05第五节 PMI——快速入门读懂经济形势",
  "key_concepts": [
    {
      "name": "采购经理人指数（PMI）",
      "definition": "采购经理人指数（PMI）是通过向企业采购经理发放月度调查问卷，汇总其对经营状况环比变化（上升、不变、下降）的定性判断，综合计算得出的指数。它反映经济活动所处的周期状态，是宏观经济的先行指标。",
      "importance": "高频、先行地反映经济环比变化，能够全面监测经济周期状态，是宏观经济的“晴雨表”，与GDP增速走势基本一致。"
    },
    {
      "name": "荣枯线",
      "definition": "PMI指数的临界值，通常为50%，是判断经济扩张与收缩的分界线。",
      "importance": "是判断经济景气度的关键分界线，高于50%表示经济总体扩张，低于50%表示收缩，数值大小反映扩张或收缩的速度。"
    },
    {
      "name": "库存周期",
      "definition": "由于企业生产滞后于需求变化，导致库存呈现3-5年周期性波动的经济短周期现象。",
      "importance": "是理解和分析经济短期波动的重要框架，与PMI指标有密切联系，用于判断经济周期阶段（如复苏、繁荣、衰退、萧条）。"
    }
  ],
  "indicators": [
    {
      "name": "制造业PMI",
      "calculation": "通过向制造业企业采购经理发放调查问卷，统计其对经营状况环比变化（上升、不变、下降）的答案百分比，加权计算得出，取值范围0-100。通常基于新订单、生产、从业人员、存货、供货商配送时间等多个扩散指数计算。",
      "interpretation": "是制造业活动的先行指标和“晴雨表”，数值高于50%表示制造业总体扩张，低于50%表示收缩。数值大小反映扩张或收缩的速度，因其与经济周期和全球贸易关联紧密而备受关注。"
    },
    {
      "name": "非制造业PMI",
      "calculation": "由新订单、业务活动预期、收费价格等扩散指数加权计算得出，涵盖服务业和建筑业活动。",
      "interpretation": "数值高于50%表明非制造业总体扩张。服务业受居民活动影响大，建筑业受基建和地产政策影响大。"
    },
    {
      "name": "生产指数",
      "calculation": "基于PMI调查问卷中关于生产活动情况的回答统计得出，反映企业生产活动的环比变化。",
      "interpretation": "代表供给侧的景气状况，反映经济的供给情况。生产指数强于新订单指数可能表明生产好于实际需求。"
    },
    {
      "name": "新订单指数",
      "calculation": "基于PMI调查问卷中关于新订单情况的回答统计得出，反映企业获得新订单数量的环比变化。",
      "interpretation": "反映国内需求的表现，是衡量需求侧的关键指标，代表内需。"
    },
    {
      "name": "新出口订单指数",
      "calculation": "基于PMI调查问卷中关于新出口订单情况的回答统计得出，反映企业获得来自国外新订单数量的环比变化。",
      "interpretation": "反映制造业外贸订单数量，是出口的先行指标，用于观察外需变动，体现外部需求。"
    },
    {
      "name": "原材料库存指数",
      "calculation": "基于PMI调查问卷中关于原材料库存水平的回答统计得出，反映企业原材料库存水平的环比变化。",
      "interpretation": "反映企业生产前端的库存状况，是衡量供给侧库存的指标，用于分析库存周期阶段。"
    },
    {
      "name": "产成品库存指数",
      "calculation": "基于PMI调查问卷中关于产成品库存水平的回答统计得出，反映企业产成品库存水平的环比变化。",
      "interpretation": "反映企业生产后端的库存状况，是衡量供给侧库存的指标，用于分析库存周期阶段和库存压力。"
    }
  ],
  "analysis_methods": [
    {
      "name": "通过PMI判断经济走势",
      "steps": "1. 观察PMI总体数值是否高于或低于50%荣枯线，判断经济处于扩张或收缩区间。 2. 重点关注制造业PMI及其细分指标（如生产、新订单、新出口订单）的变化，分析供给、内需、外需的具体情况。 3. 结合库存指标（原材料库存、产成品库存）分析经济所处的库存周期阶段。",
      "application": "用于高频跟踪和预判宏观经济状况，例如判断经济修复的强弱、识别需求不足等问题。"
    },
    {
      "name": "库存周期四阶段分析法",
      "steps": "1. 被动去库存：需求回升，生产尚未跟进，库存被动下降。对应经济复苏阶段。 2. 主动补库存：需求旺盛，企业主动增加生产以补充库存。对应经济繁荣阶段。 3. 被动补库存：需求开始下降，生产未及时调整，库存被动增加。对应经济衰退阶段。 4. 主动去库存：需求低迷，企业主动削减生产以减少库存。对应经济萧条阶段。",
      "application": "分析3-5年的经济短周期波动，通过观察需求指标（新订单）和库存指标（原材料库存、产成品库存）的组合变化来定位当前经济周期阶段。"
    },
    {
      "name": "PMI综合分析法",
      "steps": "1. 看总体：判断制造业/非制造业PMI是否高于荣枯线，确认经济总体处于扩张还是收缩区间。2. 看结构：对比生产指数与新订单、新出口订单指数，判断供需强弱关系（例如，生产>需求可能反映需求不足）。3. 看周期：结合新订单指数（需求侧）与原材料、产成品库存指数（供给侧），判断库存周期所处的阶段（如被动去库存）。4. 结合案例与趋势：将当前数据置于历史序列中，并结合具体经济事件（如疫情后服务业恢复）进行解读。",
      "application": "用于高频、先行地预判宏观经济走势，识别经济复苏、扩张、衰退或萧条的不同阶段及主要矛盾（如需求不足）。"
    }
  ],
  "summary": "采购经理人指数（PMI）是通过月度问卷调查编制的经济先行指标，用于高频监测宏观经济景气变化。其数值以50%为荣枯线，高于50%表示经济扩张，低于50%表示收缩。PMI分为制造业PMI和非制造业PMI，其中制造业PMI因与经济周期和全球贸易关系密切而更受关注，非制造业PMI反映服务业和建筑业活动。核心细分指标包括反映供给的生产指数、反映内需的新订单指数、反映外需的新出口订单指数，以及反映库存周期的原材料库存指数和产成品库存指数。这些指标是分析3-5年库存周期（如被动去库存、主动补库存等阶段）的重要工具，为研判短期经济波动提供了关键框架。PMI与库存周期分析紧密结合，是判断经济走势的重要工具。"
}