{
  "topic": "11.第十一节 基金投资手册",
  "key_concepts": [
    {
      "name": "基金",
      "definition": "一种集合理财方式。投资者将资金交给专业机构管理，实现收益共享、风险共担。",
      "importance": "基础概念，理解基金的本质是进行投资的前提。"
    },
    {
      "name": "主动型基金",
      "definition": "基金经理通过投研和主动管理博取超额收益的基金。",
      "importance": "高收益伴随高波动，其核心是挑选基金经理，存在经理变更风险。"
    },
    {
      "name": "被动型基金（指数基金）",
      "definition": "跟踪特定指数，以获取市场平均收益的基金。受基金经理影响小，管理费率低。",
      "importance": "投资成本低，核心是挑选指数。"
    },
    {
      "name": "按投向分类",
      "definition": "基金根据主要投资资产类型可分为：股票型（80%以上资产投股票）、混合型（灵活投资股、债、货，无明确比例限制）、债券型（80%以上资产投债券）、货币型（低风险现金管理类产品）。",
      "importance": "了解基金风险收益特征的基础分类方式。"
    },
    {
      "name": "宽基指数",
      "definition": "覆盖范围广、包含多个行业的股票指数，抗周期风险能力强。例如：上证50、沪深300、中证500、创业板指。",
      "importance": "适合初学者或想要省心投资的投资者，是构建投资组合的基础。"
    },
    {
      "name": "窄基指数（行业指数）",
      "definition": "专注跟踪特定行业或主题的股票指数。例如：医药生物、食品饮料、电子、金融等指数。",
      "importance": "适合有经验或对特定行业有研究的投资者，需配合产业政策分析，波动性和风险相对较高。"
    }
  ],
  "indicators": [
    {
      "name": "历史业绩",
      "calculation": "基金经理管理的基金产品过往的收益率表现。",
      "interpretation": "重点应关注长期（如3-5年以上）的业绩稳定性与持续性，而非短期波动或排名。"
    },
    {
      "name": "从业年限",
      "calculation": "基金经理在投资领域的任职时间。",
      "interpretation": "通常经验越丰富的经理，应对不同市场环境变化的能力越强。"
    },
    {
      "name": "风控能力（最大回撤）",
      "calculation": "在选定周期内，产品净值从最高点回落至最低点的最大幅度。",
      "interpretation": "用于评估基金经理在熊市或市场下跌时的风险控制能力，回撤越小，控制风险能力通常越强。"
    }
  ],
  "analysis_methods": [
    {
      "name": "60/40股债平衡策略",
      "steps": "1. 构建一个初始投资组合，保持股票资产占比约60%，债券资产占比约40%。2. 定期（如每季度或每年）检查组合比例。3. 当股票上涨导致其仓位超过60%时，卖出部分股票，买入债券，使比例恢复；反之亦然。",
      "application": "一种被动的资产配置再平衡方法，能自动实现“高卖低买”，帮助投资者克服情绪干扰，提升长期组合收益。"
    },
    {
      "name": "避免追涨杀跌",
      "steps": "认识到市场短期波动难以预测，大部分择时操作效果不理想。",
      "application": "通过坚持长期投资、定投或采用上述再平衡策略来替代主观的频繁交易。"
    },
    {
      "name": "理性看待明星基金经理",
      "steps": "1. 理解基金公司的“造星”动机（扩大规模收取管理费）。2. 认识到冠军业绩或明星光环的持续性往往较差。",
      "application": "挑选基金经理时应依据其长期稳定的“三要素”（历史业绩、从业年限、风控能力）进行综合判断，而非盲目追捧短期明星。"
    }
  ],
  "summary": "基金是一种收益共享、风险共担的集合理财工具。核心分类包括：按投向分为股票型、混合型、债券型、货币型；按管理方式分为主动管理型和被动指数型。挑选主动型基金的本质是挑选基金经理，需重点考察其历史业绩、从业年限和风控能力（最大回撤）。挑选指数基金则是挑选指数，宽基指数（如沪深300）适合新手，窄基指数（行业指数）需配合行业分析。成功的基金投资需遵守纪律：避免追涨杀跌和迷信明星效应，可尝试采用60/40股债平衡等策略进行长期、理性的资产配置。"
}