{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "beb6fec6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv(\"../config/.env\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ae435fc8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "# 创建数据库连接\n",
    "neo4j_graph = Neo4jGraph()\n",
    "\n",
    "movies_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM\n",
    "'https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/movies/movies_small.csv'\n",
    "AS row\n",
    "MERGE (m:Movie {id:row.movieId})\n",
    "SET m.released = date(row.released),\n",
    "    m.title = row.title,\n",
    "    m.imdbRating = toFloat(row.imdbRating)\n",
    "FOREACH (director in split(row.director, '|') |\n",
    "    MERGE (p:Person {name:trim(director)})\n",
    "    MERGE (p)-[:DIRECTED]->(m))\n",
    "FOREACH (actor in split(row.actors, '|') |\n",
    "    MERGE (p:Person {name:trim(actor)})\n",
    "    MERGE (p)-[:ACTED_IN]->(m))\n",
    "FOREACH (genre in split(row.genres, '|') |\n",
    "    MERGE (g:Genre {name:trim(genre)})\n",
    "    MERGE (m)-[:IN_GENRE]->(g))\n",
    "\"\"\"\n",
    "\n",
    "neo4j_graph.query(movies_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0cb9e02a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Movie {id: STRING, released: DATE, title: STRING, imdbRating: FLOAT}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "neo4j_graph.refresh_schema()\n",
    "print(neo4j_graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fd27bb3f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "- **Movie**\n",
      "  - `id`: STRING Example: \"1\"\n",
      "  - `released`: DATE Min: 1964-12-16, Max: 1996-09-15\n",
      "  - `title`: STRING Example: \"Toy Story\"\n",
      "  - `imdbRating`: FLOAT Min: 2.4, Max: 9.3\n",
      "- **Person**\n",
      "  - `name`: STRING Example: \"John Lasseter\"\n",
      "- **Genre**\n",
      "  - `name`: STRING Example: \"Adventure\"\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "enhanced_graph = Neo4jGraph(enhanced_schema=True)\n",
    "print(enhanced_graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b6f9b4e1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (m:Movie {title: \"Casino\"})<-[:ACTED_IN]-(p:Person) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Robert De Niro'}, {'p.name': 'Joe Pesci'}, {'p.name': 'Sharon Stone'}, {'p.name': 'James Woods'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': {'query: Casino 的演员有哪些'},\n",
       " 'result': '电影《Casino》的演员包括罗伯特·德尼罗、乔·佩西、莎朗·斯通和詹姆斯·伍兹。'}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain.chat_models import init_chat_model\n",
    "from langchain_neo4j import GraphCypherQAChain\n",
    "\n",
    "llm = init_chat_model(\n",
    "    \"deepseek-chat\",\n",
    "    model_provider=\"deepseek\",\n",
    "    temperature=0,\n",
    ")\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    graph=enhanced_graph,\n",
    "    llm=llm,\n",
    "    verbose=True,\n",
    "    allow_dangerous_requests=True,\n",
    ")\n",
    "response = chain.invoke({\"query\": \"Casino 的演员有哪些\"})\n",
    "response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6388f361",
   "metadata": {},
   "outputs": [],
   "source": [
    "from operator import add\n",
    "from typing import Annotated, List, Literal\n",
    "from typing_extensions import TypedDict\n",
    "\n",
    "class InputState(TypedDict):\n",
    "    question: str\n",
    "\n",
    "class OverallState(TypedDict):\n",
    "    question: str\n",
    "    next_action: str\n",
    "    cypher_statement: str\n",
    "    cypher_errors: List[str]\n",
    "    database_records: List[dict]\n",
    "    steps: Annotated[List[str], add]\n",
    "\n",
    "class OutputState(TypedDict):\n",
    "    answer: str\n",
    "    steps: List[str]\n",
    "    cypher_statement: str\n",
    "\n",
    "def guardrails_condition(\n",
    "    state: OverallState\n",
    ") -> Literal[\"generate_cypher\", \"generate_final_answer\"]:\n",
    "    if state.get(\"next_action\") == \"end\":\n",
    "        return \"generate_final_answer\"\n",
    "    else:\n",
    "        return \"generate_cypher\"\n",
    "\n",
    "def validate_cypher_condition(\n",
    "    state: OverallState\n",
    ") -> Literal[\"generate_final_answer\", \"execute_cypher\", \"correct_cypher\"]:\n",
    "    if state.get(\"next_action\") == \"end\":\n",
    "        return \"generate_final_answer\"\n",
    "    elif state.get(\"next_action\") == \"execute_cypher\":\n",
    "        return \"execute_cypher\"\n",
    "    else:\n",
    "        return \"correct_cypher\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "52cc6e75",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pydantic import BaseModel, Field\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "\n",
    "guardrails_system = \"\"\"\n",
    "作为一名智能助手，你的主要目标是判断给定的问题是否与电影相关。如果该问题与电影相关，输出“movie”；否则，输出“end”。\n",
    "为做出这一判断，需评估问题的内容，确定其是否涉及任何电影、演员、导演、电影行业或相关话题。仅提供指定的输出：“movie”或“end”。\n",
    "\"\"\"\n",
    "guardrails_prompt = ChatPromptTemplate(\n",
    "    [\n",
    "        (\"system\", guardrails_system),\n",
    "        (\"human\", \"{question}\")\n",
    "    ]\n",
    ")\n",
    "\n",
    "class GuardrailsOutput(BaseModel):\n",
    "    decision: Literal[\"movie\", \"end\"] = Field(description=\"关于该问题是否与电影相关的决定\")\n",
    "\n",
    "guardrails_chain = guardrails_prompt | llm.with_structured_output(GuardrailsOutput)\n",
    "\n",
    "def guardrails(state: InputState):\n",
    "    \"\"\"判断该问题是否与电影相关。\"\"\"\n",
    "\n",
    "    guardrails_output = guardrails_chain.invoke({\"question\": state[\"question\"]})\n",
    "    database_records = (\n",
    "        \"这个问题与电影及其演员无关。因此，我无法回答这个问题。\"\n",
    "        if guardrails_output.decision == \"end\"\n",
    "        else None\n",
    "    )\n",
    "\n",
    "    return {\n",
    "        \"next_action\": guardrails_output.decision,\n",
    "        \"database_records\": database_records,\n",
    "        \"steps\": [\"guardrail\"],\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "937d8d8b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_huggingface import HuggingFaceEmbeddings\n",
    "from langchain_neo4j import Neo4jVector\n",
    "\n",
    "embeddings = HuggingFaceEmbeddings(model_name=\"Qwen/Qwen3-Embedding-0.6B\")\n",
    "\n",
    "examples = [\n",
    "    {\n",
    "        \"question\": \"有多少位演员？\",\n",
    "        \"query\": \"MATCH (a:Person)-[:ACTED_IN]->(:Movie) RETURN count(DISTINCT a)\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"哪些演员出演了电影《赌城风云》？\",\n",
    "        \"query\": \"MATCH (m:Movie {title: 'Casino'})<-[:ACTED_IN]-(a) RETURN a.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"汤姆·汉克斯出演了多少部电影？\",\n",
    "        \"query\": \"MATCH (a:Person {name: 'Tom Hanks'})-[:ACTED_IN]->(m:Movie) RETURN count(m)\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"列出电影《辛德勒的名单》的所有类型\",\n",
    "        \"query\": \"MATCH (m:Movie {title: 'Schindler's List'})-[:IN_GENRE]->(g:Genre) RETURN g.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"哪些演员同时出演过喜剧和动作类电影？\",\n",
    "        \"query\": \"MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g1:Genre), (a)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g2:Genre) WHERE g1.name = 'Comedy' AND g2.name = 'Action' RETURN DISTINCT a.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"哪些导演执导的电影中至少有三位名叫'John'的不同演员？\",\n",
    "        \"query\": \"MATCH (d:Person)-[:DIRECTED]->(m:Movie)<-[:ACTED_IN]-(a:Person) WHERE a.name STARTS WITH 'John' WITH d, COUNT(DISTINCT a) AS JohnsCount WHERE JohnsCount >= 3 RETURN d.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"找出导演也在片中出演的电影\",\n",
    "        \"query\": \"MATCH (p:Person)-[:DIRECTED]->(m:Movie), (p)-[:ACTED_IN]->(m) RETURN m.title, p.name\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"找出数据库中出演电影数量最多的演员\",\n",
    "        \"query\": \"MATCH (a:Actor)-[:ACTED_IN]->(m:Movie) RETURN a.name, COUNT(m) AS movieCount ORDER BY movieCount DESC LIMIT 1\",\n",
    "    },\n",
    "]\n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    embeddings,\n",
    "    Neo4jVector,\n",
    "    k=5,\n",
    "    input_keys=[\"question\"]\n",
    ")\n",
    "\n",
    "text2cypher_prompt = ChatPromptTemplate(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            (\n",
    "                \"给定一个输入问题，将其转换为Cypher查询。无需前言。\"\n",
    "                \"不要用任何反引号或其他东西包裹响应。只返回Cypher语句！\",\n",
    "            ),\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\n",
    "                \"\"\"\n",
    "你是一名 Neo4j 专家。给定一个输入问题，创建一个语法正确的 Cypher 查询来运行。\n",
    "不要用任何反引号或其他东西包裹响应。只返回 Cypher 语句！\n",
    "以下是模式信息\n",
    "{schema}\n",
    "以下是一些问题及其对应的 Cypher 查询示例。\n",
    "{fewshot_examples}\n",
    "用户输入：{question}\n",
    "Cypher 查询：\n",
    "                \"\"\"\n",
    "            ),\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "text2cypher_chain = text2cypher_prompt | llm | StrOutputParser()\n",
    "\n",
    "def generate_cypher(state: OverallState) -> OverallState:\n",
    "    \"\"\"基于提供的模式和用户输入生成一个Cypher语句\"\"\"\n",
    "\n",
    "    fewshot_examples = \"\\n\\n\".join(\n",
    "        [\n",
    "            f\"用户输入：{el['question']}\\nCypher 查询：{el['query']}\"\n",
    "            for el in example_selector.select_examples({\"question\": state.get(\"question\")})\n",
    "        ]\n",
    "    )\n",
    "    generated_cypher = text2cypher_chain.invoke(\n",
    "        {\n",
    "            \"question\": state.get(\"question\"),\n",
    "            \"fewshot_examples\": fewshot_examples,\n",
    "            \"schema\": enhanced_graph.schema\n",
    "        }\n",
    "    )\n",
    "\n",
    "    return {\n",
    "        \"cypher_statement\": generated_cypher,\n",
    "        \"steps\": [\"generate_cypher\"],\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "584c113e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Optional\n",
    "from langchain_neo4j.chains.graph_qa.cypher_utils import CypherQueryCorrector, Schema\n",
    "from neo4j.exceptions import CypherSyntaxError\n",
    "\n",
    "validate_cypher_system = \"你是一名密码专家，正在审阅一位初级开发人员编写的语句。\"\n",
    "validate_cypher_user = \"\"\"\n",
    "你必须检查以下内容：\n",
    "Cypher 语句中是否存在任何语法错误？\n",
    "Cypher 语句中是否有任何缺失或未定义的变量？\n",
    "模式中是否缺少任何节点标签？\n",
    "模式中是否缺少任何关系类型？\n",
    "是否有任何属性未包含在模式中？\n",
    "Cypher 语句是否包含足够的信息来回答该问题？\n",
    "良好错误示例：\n",
    "Label（:Foo）不存在，您是不是想说（:Bar）？\n",
    "Property Foo 没有属性 bar，您是不是想说 baz？\n",
    "Relationship FOO 不存在，您是不是想说 FOO_BAR？\n",
    "模式：\n",
    "{schema}\n",
    "问题是：\n",
    "{question}\n",
    "Cypher 语句是：\n",
    "{cypher}\n",
    "请确保不要出错！\n",
    "\"\"\"\n",
    "validate_cypher_prompt = ChatPromptTemplate(\n",
    "    [\n",
    "        (\"system\", validate_cypher_system),\n",
    "        (\"human\", validate_cypher_user)\n",
    "    ]\n",
    ")\n",
    "\n",
    "class Property(BaseModel):\n",
    "    \"\"\"表示基于Cypher语句中图形里特定节点属性的过滤条件。\"\"\"\n",
    "\n",
    "    node_label: str = Field(description=\"此属性所属节点的标签。\")\n",
    "    property_key: str = Field(description=\"被过滤属性的键。\")\n",
    "    property_value: str = Field(description=\"该属性要匹配的值。\")\n",
    "\n",
    "class ValidateCypherOutput(BaseModel):\n",
    "    \"\"\"表示 Cypher 查询输出的验证结果，包括任何错误和应用的过滤器。\"\"\"\n",
    "\n",
    "    errors: Optional[List[str]] = Field(\n",
    "        description=\"Cypher 语句中的语法或语义错误列表。务必解释模式与 Cypher 语句之间的不一致之处\"\n",
    "    )\n",
    "    filters: Optional[List[Property]] = Field(description=\"Cypher语句中应用的一系列基于属性的过滤器。\")\n",
    "\n",
    "validate_cypher_chain = validate_cypher_prompt | llm.with_structured_output(\n",
    "    ValidateCypherOutput\n",
    ")\n",
    "corrector_schema = [\n",
    "    Schema(el[\"start\"], el[\"type\"], el[\"end\"])\n",
    "    for el in enhanced_graph.structured_schema.get(\"relationships\")\n",
    "]\n",
    "cypher_query_corrector = CypherQueryCorrector(corrector_schema)\n",
    "\n",
    "def validate_cypher(state: OverallState) -> OverallState:\n",
    "    \"\"\"验证Cypher语句，并将所有属性值映射到数据库。\"\"\"\n",
    "\n",
    "    errors = []\n",
    "    mapping_errors = []\n",
    "\n",
    "    try:\n",
    "        enhanced_graph.query(f\"EXPLAIN {state.get('cypher_statement')}\")\n",
    "    except CypherSyntaxError as e:\n",
    "        errors.append(e.message)\n",
    "\n",
    "    corrected_cypher = cypher_query_corrector(state.get(\"cypher_statement\"))\n",
    "    if not corrected_cypher:\n",
    "        errors.append(\"生成的Cypher语句不符合图形模式\")\n",
    "    if not corrected_cypher == state.get(\"cypher_statement\"):\n",
    "        print(\"关系方向已更正\")\n",
    "\n",
    "    llm_output = validate_cypher_chain.invoke(\n",
    "        {\n",
    "            \"question\": state.get(\"question\"),\n",
    "            \"schema\": enhanced_graph.schema,\n",
    "            \"cypher\": state.get(\"cypher_statement\")\n",
    "        }\n",
    "    )\n",
    "    if llm_output.errors:\n",
    "        errors.extend(llm_output.errors)\n",
    "    if llm_output.filters:\n",
    "        for filter in llm_output.filters:\n",
    "            if (\n",
    "                not [\n",
    "                    prop\n",
    "                    for prop in enhanced_graph.structured_schema[\"node_props\"][filter.node_label]\n",
    "                    if prop[\"property\"] == filter.property_key\n",
    "                ][0][\"type\"] == \"STRING\"\n",
    "            ):\n",
    "                continue\n",
    "\n",
    "            mapping = enhanced_graph.query(\n",
    "                f\"MATCH (n:{filter.node_label}) WHERE toLower(n.`{filter.property_key}`) = toLower($value) RETURN 'yes' LIMIT 1\",\n",
    "                {\"value\": filter.property_value},\n",
    "            )\n",
    "            if not mapping:\n",
    "                not_mapping_error_message = f\"{filter.node_label} 在属性 {filter.property_key} 上、值为 {filter.property_value} 时的缺失值映射\"\n",
    "                print(not_mapping_error_message)\n",
    "                mapping_errors.append(not_mapping_error_message)\n",
    "\n",
    "    if mapping_errors:\n",
    "        next_action = \"end\"\n",
    "    elif errors:\n",
    "        next_action = \"correct_cypher\"\n",
    "    else:\n",
    "        next_action = \"execute_cypher\"\n",
    "\n",
    "    return {\n",
    "        \"next_action\": next_action,\n",
    "        \"cypher_statement\": corrected_cypher,\n",
    "        \"cypher_errors\": errors,\n",
    "        \"steps\": [\"validate_cypher\"],\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1d0b3c59",
   "metadata": {},
   "outputs": [],
   "source": [
    "correct_cypher_prompt = ChatPromptTemplate(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            (\n",
    "                \"你是一名密码专家，正在审阅一名初级开发人员编写的语句。\"\n",
    "                \"你需要根据所提供的错误来修正密码语句。无需开场白。\"\n",
    "                \"不要用任何反引号或其他东西包裹回应。只回应密码语句！\"\n",
    "            ),\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\n",
    "                \"\"\"\n",
    "检查无效的语法或语义，并返回修正后的Cypher语句。\n",
    "模式：\n",
    "{schema}\n",
    "注意：回复中不要包含任何解释或道歉。\n",
    "不要用任何反引号或其他东西包裹回复。\n",
    "只回复Cypher语句！\n",
    "对于任何不要求你构建Cypher语句的问题，都不要回复。\n",
    "问题是：\n",
    "{question}\n",
    "Cypher语句是：\n",
    "{cypher}\n",
    "错误是：\n",
    "{errors}\n",
    "修正后的Cypher语句：\n",
    "                \"\"\"\n",
    "            )\n",
    "        )\n",
    "    ]\n",
    ")\n",
    "\n",
    "correct_cypher_chain = correct_cypher_prompt | llm | StrOutputParser()\n",
    "\n",
    "def correct_cypher(state: OverallState) -> OverallState:\n",
    "    \"\"\"根据提供的错误修正Cypher语句。\"\"\"\n",
    "\n",
    "    corrected_cypher = correct_cypher_chain.invoke(\n",
    "        {\n",
    "            \"question\": state.get(\"question\"),\n",
    "            \"cypher\": state.get(\"cypher_statement\"),\n",
    "            \"errors\": state.get(\"cypher_errors\"),\n",
    "            \"schema\": enhanced_graph.schema,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    return {\n",
    "        \"next_action\": \"validate_cypher\",\n",
    "        \"cypher_statement\": corrected_cypher,\n",
    "        \"steps\": [\"correct_cypher\"]\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bf05bd91",
   "metadata": {},
   "outputs": [],
   "source": [
    "def execute_cypher(state: OverallState) -> OverallState:\n",
    "    \"\"\"执行给定的Cypher语句。\"\"\"\n",
    "\n",
    "    records = enhanced_graph.query(state.get(\"cypher_statement\"))\n",
    "    no_results = \"我在数据库中找不到任何相关信息\"\n",
    "\n",
    "    return {\n",
    "        \"database_records\": records if records else no_results,\n",
    "        \"steps\": [\"execute_cypher\"],\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "561bbdd0",
   "metadata": {},
   "outputs": [],
   "source": [
    "generate_final_prompt = ChatPromptTemplate(\n",
    "    [\n",
    "        (\"system\", \"你是一个乐于助人的助手\"),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\n",
    "                \"\"\"\n",
    "请使用从数据库中检索到的以下结果，对用户的问题给出简洁、明确的答案。直接以回答问题的方式进行回应。\n",
    "结果：{results}\n",
    "问题：{question}\n",
    "                \"\"\"\n",
    "            )\n",
    "        )\n",
    "    ]\n",
    ")\n",
    "\n",
    "generate_final_chain = generate_final_prompt | llm | StrOutputParser()\n",
    "\n",
    "def generate_final_answer(state: OverallState) -> OutputState:\n",
    "    \"\"\"根据数据库结果生成最终答案\"\"\"\n",
    "\n",
    "    final_answer = generate_final_chain.invoke(\n",
    "        {\n",
    "            \"question\": state.get(\"question\"),\n",
    "            \"results\": state.get(\"database_records\"),\n",
    "        }\n",
    "    )\n",
    "\n",
    "    return {\n",
    "        \"answer\": final_answer,\n",
    "        \"steps\": [\"generate_final_answer\"],\n",
    "    }"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "422d523c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langgraph.graph import StateGraph, START, END\n",
    "\n",
    "graph = StateGraph(OverallState, input=InputState, output=OutputState)\n",
    "graph.add_node(guardrails)\n",
    "graph.add_node(generate_cypher)\n",
    "graph.add_node(validate_cypher)\n",
    "graph.add_node(correct_cypher)\n",
    "graph.add_node(execute_cypher)\n",
    "graph.add_node(generate_final_answer)\n",
    "\n",
    "graph.add_edge(START, \"guardrails\")\n",
    "graph.add_conditional_edges(\"guardrails\", guardrails_condition)\n",
    "graph.add_edge(\"generate_cypher\", \"validate_cypher\")\n",
    "graph.add_conditional_edges(\"validate_cypher\", validate_cypher_condition)\n",
    "graph.add_edge(\"correct_cypher\", \"validate_cypher\")\n",
    "graph.add_edge(\"execute_cypher\", \"generate_final_answer\")\n",
    "graph.add_edge(\"generate_final_answer\", END)\n",
    "\n",
    "graph = graph.compile()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cdfb38b8",
   "metadata": {},
   "outputs": [],
   "source": [
    "from IPython.display import display, Image\n",
    "from langchain_core.runnables.graph_mermaid import MermaidDrawMethod\n",
    "\n",
    "display(Image(graph.get_graph().draw_mermaid_png(draw_method=MermaidDrawMethod.PYPPETEER)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "08f2f981",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.invoke({\"question\": \"今天北京的天气怎么样？\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "aedb26bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.invoke({\"question\": \"Casino 的演员有哪些？\"})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "analyst_chain",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
